Revit 2027 API
ElementIdParameterValue Methods
The ElementIdParameterValue type exposes the following members.
Methods
Name | Description
Copy |  Makes an identical copy of the given parameter value.
(Inherited from ParameterValue)
Dispose
(Inherited from ParameterValue)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsEqual |  Tests equality with another instance of the same class.
(Inherited from ParameterValue)
IsSameType |  Tests another instance is of the same value type.
(Inherited from ParameterValue)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ElementIdParameterValue Class
Autodesk.Revit.DB Namespace